# GetDuctFittingAndAccessoryData Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctFittingAndAccessoryPressureDropUIDataItem..::..GetDuctFittingAndAccessoryData Method
DuctFittingAndAccessoryPressureDropUIDataItem Class See Also
---
Gets the fitting data stored in the UI data item.
**Namespace:** Autodesk.Revit.UI.Mechanical**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public DuctFittingAndAccessoryData GetDuctFittingAndAccessoryData()
```

Visual Basic
---
```text
Public Function GetDuctFittingAndAccessoryData As DuctFittingAndAccessoryData
```

Visual C++
---
```text
public:
DuctFittingAndAccessoryData^ GetDuctFittingAndAccessoryData()
```

# ### Return Value
The fitting data stored in the UI data item.
# See Also
DuctFittingAndAccessoryPressureDropUIDataItem Class
Autodesk.Revit.UI.Mechanical Namespace